/* automatically generated by rust-bindgen */

pub const NV_CTRL_TARGET_TYPE_X_SCREEN: u32 = 0;
pub const NV_CTRL_TARGET_TYPE_GPU: u32 = 1;
pub const NV_CTRL_TARGET_TYPE_FRAMELOCK: u32 = 2;
pub const NV_CTRL_TARGET_TYPE_VCSC: u32 = 3;
pub const NV_CTRL_TARGET_TYPE_GVI: u32 = 4;
pub const NV_CTRL_TARGET_TYPE_COOLER: u32 = 5;
pub const NV_CTRL_TARGET_TYPE_THERMAL_SENSOR: u32 = 6;
pub const NV_CTRL_TARGET_TYPE_3D_VISION_PRO_TRANSCEIVER: u32 = 7;
pub const NV_CTRL_TARGET_TYPE_DISPLAY: u32 = 8;
pub const NV_CTRL_FLATPANEL_SCALING: u32 = 2;
pub const NV_CTRL_FLATPANEL_SCALING_DEFAULT: u32 = 0;
pub const NV_CTRL_FLATPANEL_SCALING_NATIVE: u32 = 1;
pub const NV_CTRL_FLATPANEL_SCALING_SCALED: u32 = 2;
pub const NV_CTRL_FLATPANEL_SCALING_CENTERED: u32 = 3;
pub const NV_CTRL_FLATPANEL_SCALING_ASPECT_SCALED: u32 = 4;
pub const NV_CTRL_FLATPANEL_DITHERING: u32 = 3;
pub const NV_CTRL_FLATPANEL_DITHERING_DEFAULT: u32 = 0;
pub const NV_CTRL_FLATPANEL_DITHERING_ENABLED: u32 = 1;
pub const NV_CTRL_FLATPANEL_DITHERING_DISABLED: u32 = 2;
pub const NV_CTRL_DITHERING: u32 = 3;
pub const NV_CTRL_DITHERING_AUTO: u32 = 0;
pub const NV_CTRL_DITHERING_ENABLED: u32 = 1;
pub const NV_CTRL_DITHERING_DISABLED: u32 = 2;
pub const NV_CTRL_DIGITAL_VIBRANCE: u32 = 4;
pub const NV_CTRL_BUS_TYPE: u32 = 5;
pub const NV_CTRL_BUS_TYPE_AGP: u32 = 0;
pub const NV_CTRL_BUS_TYPE_PCI: u32 = 1;
pub const NV_CTRL_BUS_TYPE_PCI_EXPRESS: u32 = 2;
pub const NV_CTRL_BUS_TYPE_INTEGRATED: u32 = 3;

pub const NV_CTRL_BINARY_DATA_GPUS_USED_BY_XSCREEN: u32 = 4;
pub const NV_CTRL_BINARY_DATA_GPUS_USING_FRAMELOCK: u32 = 5;
pub const NV_CTRL_BINARY_DATA_DISPLAY_VIEWPORT: u32 = 6;
pub const NV_CTRL_BINARY_DATA_FRAMELOCKS_USED_BY_GPU: u32 = 7;
pub const NV_CTRL_BINARY_DATA_GPUS_USING_VCSC: u32 = 8;
pub const NV_CTRL_BINARY_DATA_VCSCS_USED_BY_GPU: u32 = 9;
pub const NV_CTRL_BINARY_DATA_COOLERS_USED_BY_GPU: u32 = 10;
pub const NV_CTRL_BINARY_DATA_GPUS_USED_BY_LOGICAL_XSCREEN: u32 = 11;
pub const NV_CTRL_BINARY_DATA_THERMAL_SENSORS_USED_BY_GPU: u32 = 12;
pub const NV_CTRL_BINARY_DATA_GLASSES_PAIRED_TO_3D_VISION_PRO_TRANSCEIVER: u32 = 13;
pub const NV_CTRL_BINARY_DATA_DISPLAY_TARGETS: u32 = 14;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_CONNECTED_TO_GPU: u32 = 15;
pub const NV_CTRL_BINARY_DATA_METAMODES_VERSION_2: u32 = 16;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ENABLED_ON_XSCREEN: u32 = 17;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ASSIGNED_TO_XSCREEN: u32 = 18;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS: u32 = 19;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_STEREO_DISPLAY_TRANSFORM_EXCLUSIVE: u32 = 0;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_OVERLAY_DISPLAY_TRANSFORM_EXCLUSIVE: u32 = 1;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_DEPTH_8_DISPLAY_TRANSFORM_EXCLUSIVE: u32 = 2;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ON_GPU: u32 = 20;
pub const NV_CTRL_BINARY_DATA_LAST_ATTRIBUTE: u32 = 20;
pub const NV_CTRL_STRING_OPERATION_ADD_METAMODE: u32 = 0;
pub const NV_CTRL_STRING_OPERATION_GTF_MODELINE: u32 = 1;
pub const NV_CTRL_STRING_OPERATION_CVT_MODELINE: u32 = 2;
pub const NV_CTRL_STRING_OPERATION_BUILD_MODEPOOL: u32 = 3;
pub const NV_CTRL_STRING_OPERATION_GVI_CONFIGURE_STREAMS: u32 = 4;
pub const NV_CTRL_STRING_OPERATION_PARSE_METAMODE: u32 = 5;
pub const NV_CTRL_STRING_OPERATION_LAST_ATTRIBUTE: u32 = 5;
pub const NV_CTRL_WARP_DATA_TYPE_BLEND_OR_OFFSET_TEXTURE: u32 = 0;
pub const NV_CTRL_WARP_DATA_TYPE_MESH_TRIANGLESTRIP_XYUVRQ: u32 = 1;
pub const NV_CTRL_WARP_DATA_TYPE_MESH_TRIANGLES_XYUVRQ: u32 = 2;
pub type __int64_t = ::std::os::raw::c_long;
pub type XID = ::std::os::raw::c_ulong;
pub type Pixmap = XID;
type Display = x11::xlib::Display;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NVCTRLAttributeValidValues {
    pub type_: ::std::os::raw::c_int,
    pub u: _NVCTRLAttributeValidValues__bindgen_ty_1,
    pub permissions: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NVCTRLAttributeValidValues__bindgen_ty_1 {
    pub range: _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1,
    pub bits: _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1 {
    pub min: i64,
    pub max: i64,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>())).min
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>())).max
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2 {
    pub ints: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>())).ints
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ints)
        )
    );
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1>())).range as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues>(),
        32usize,
        concat!("Size of: ", stringify!(_NVCTRLAttributeValidValues))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues>(),
        8usize,
        concat!("Alignment of ", stringify!(_NVCTRLAttributeValidValues))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).permissions as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(permissions)
        )
    );
}
pub type NVCTRLAttributeValidValuesRec = _NVCTRLAttributeValidValues;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributePermissions {
    pub type_: ::std::os::raw::c_int,
    pub permissions: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributePermissions() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributePermissions>(),
        8usize,
        concat!("Size of: ", stringify!(_NVCTRLAttributePermissions))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributePermissions>(),
        4usize,
        concat!("Alignment of ", stringify!(_NVCTRLAttributePermissions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributePermissions>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributePermissions),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributePermissions>())).permissions as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributePermissions),
            "::",
            stringify!(permissions)
        )
    );
}
pub type NVCTRLAttributePermissionsRec = _NVCTRLAttributePermissions;
extern "C" {
    pub fn XNVCTRLQueryExtension(
        dpy: *mut Display,
        event_basep: *mut ::std::os::raw::c_int,
        error_basep: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLQueryVersion(
        dpy: *mut Display,
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLIsNvScreen(
        dpy: *mut Display,
        screen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLQueryTargetCount(
        dpy: *mut Display,
        target_type: ::std::os::raw::c_int,
        value: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLSetAttribute(
