/* automatically generated by rust-bindgen */

use std::os::raw::{c_int, c_uint, c_float};

pub const NV_CTRL_TARGET_TYPE_X_SCREEN: c_int = 0;
pub const NV_CTRL_TARGET_TYPE_GPU: c_int = 1;
pub const NV_CTRL_TARGET_TYPE_FRAMELOCK: c_int = 2;
pub const NV_CTRL_TARGET_TYPE_VCSC: c_int = 3;
pub const NV_CTRL_TARGET_TYPE_GVI: c_int = 4;
pub const NV_CTRL_TARGET_TYPE_COOLER: c_int = 5;
pub const NV_CTRL_TARGET_TYPE_THERMAL_SENSOR: c_int = 6;
pub const NV_CTRL_TARGET_TYPE_3D_VISION_PRO_TRANSCEIVER: c_int = 7;
pub const NV_CTRL_TARGET_TYPE_DISPLAY: c_int = 8;
pub const NV_CTRL_FLATPANEL_SCALING: c_uint = 2;
pub const NV_CTRL_FLATPANEL_SCALING_DEFAULT: c_uint = 0;
pub const NV_CTRL_FLATPANEL_SCALING_NATIVE: c_uint = 1;
pub const NV_CTRL_FLATPANEL_SCALING_SCALED: c_uint = 2;
pub const NV_CTRL_FLATPANEL_SCALING_CENTERED: c_uint = 3;
pub const NV_CTRL_FLATPANEL_SCALING_ASPECT_SCALED: c_uint = 4;
pub const NV_CTRL_FLATPANEL_DITHERING: c_uint = 3;
pub const NV_CTRL_FLATPANEL_DITHERING_DEFAULT: c_uint = 0;
pub const NV_CTRL_FLATPANEL_DITHERING_ENABLED: c_uint = 1;
pub const NV_CTRL_FLATPANEL_DITHERING_DISABLED: c_uint = 2;
pub const NV_CTRL_DITHERING: c_uint = 3;
pub const NV_CTRL_DITHERING_AUTO: c_uint = 0;
pub const NV_CTRL_DITHERING_ENABLED: c_uint = 1;
pub const NV_CTRL_DITHERING_DISABLED: c_uint = 2;
pub const NV_CTRL_DIGITAL_VIBRANCE: c_uint = 4;
pub const NV_CTRL_BUS_TYPE: c_uint = 5;
pub const NV_CTRL_BUS_TYPE_AGP: c_uint = 0;
pub const NV_CTRL_BUS_TYPE_PCI: c_uint = 1;

pub const NV_CTRL_BINARY_DATA_GPUS_USING_FRAMELOCK: c_uint = 5;
pub const NV_CTRL_BINARY_DATA_DISPLAY_VIEWPORT: c_uint = 6;
pub const NV_CTRL_BINARY_DATA_FRAMELOCKS_USED_BY_GPU: c_uint = 7;
pub const NV_CTRL_BINARY_DATA_GPUS_USING_VCSC: c_uint = 8;
pub const NV_CTRL_BINARY_DATA_VCSCS_USED_BY_GPU: c_uint = 9;
pub const NV_CTRL_BINARY_DATA_COOLERS_USED_BY_GPU: c_uint = 10;
pub const NV_CTRL_BINARY_DATA_GPUS_USED_BY_LOGICAL_XSCREEN: c_uint = 11;
pub const NV_CTRL_BINARY_DATA_THERMAL_SENSORS_USED_BY_GPU: c_uint = 12;
pub const NV_CTRL_BINARY_DATA_GLASSES_PAIRED_TO_3D_VISION_PRO_TRANSCEIVER: c_uint = 13;
pub const NV_CTRL_BINARY_DATA_DISPLAY_TARGETS: c_uint = 14;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_CONNECTED_TO_GPU: c_uint = 15;
pub const NV_CTRL_BINARY_DATA_METAMODES_VERSION_2: c_uint = 16;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ENABLED_ON_XSCREEN: c_uint = 17;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ASSIGNED_TO_XSCREEN: c_uint = 18;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS: c_uint = 19;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_STEREO_DISPLAY_TRANSFORM_EXCLUSIVE: c_uint = 0;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_OVERLAY_DISPLAY_TRANSFORM_EXCLUSIVE: c_uint = 1;
pub const NV_CTRL_BINARY_DATA_GPU_FLAGS_DEPTH_8_DISPLAY_TRANSFORM_EXCLUSIVE: c_uint = 2;
pub const NV_CTRL_BINARY_DATA_DISPLAYS_ON_GPU: c_uint = 20;
pub const NV_CTRL_BINARY_DATA_LAST_ATTRIBUTE: c_uint = 20;
pub const NV_CTRL_STRING_OPERATION_ADD_METAMODE: c_uint = 0;
pub const NV_CTRL_STRING_OPERATION_GTF_MODELINE: c_uint = 1;
pub const NV_CTRL_STRING_OPERATION_CVT_MODELINE: c_uint = 2;
pub const NV_CTRL_STRING_OPERATION_BUILD_MODEPOOL: c_uint = 3;
pub const NV_CTRL_STRING_OPERATION_GVI_CONFIGURE_STREAMS: c_uint = 4;
pub const NV_CTRL_STRING_OPERATION_PARSE_METAMODE: c_uint = 5;
pub const NV_CTRL_STRING_OPERATION_LAST_ATTRIBUTE: c_uint = 5;
pub const NV_CTRL_WARP_DATA_TYPE_BLEND_OR_OFFSET_TEXTURE: c_uint = 0;
pub const NV_CTRL_WARP_DATA_TYPE_MESH_TRIANGLESTRIP_XYUVRQ: c_uint = 1;
pub const NV_CTRL_WARP_DATA_TYPE_MESH_TRIANGLES_XYUVRQ: c_uint = 2;

pub type __int64_t = std::os::raw::c_long;
pub type XID = std::os::raw::c_ulong;
pub type Pixmap = XID;
type Display = x11::xlib::Display;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NVCTRLAttributeValidValues {
    pub type_: ::std::os::raw::c_int,
    pub u: _NVCTRLAttributeValidValues__bindgen_ty_1,
    pub permissions: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NVCTRLAttributeValidValues__bindgen_ty_1 {
    pub range: _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1,
    pub bits: _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1 {
    pub min: i64,
    pub max: i64,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>())).min
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1>())).max
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2 {
    pub ints: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2>())).ints
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ints)
        )
    );
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1>())).range as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
}
#[test]
fn bindgen_test_layout__NVCTRLAttributeValidValues() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributeValidValues>(),
        32usize,
        concat!("Size of: ", stringify!(_NVCTRLAttributeValidValues))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributeValidValues>(),
        8usize,
        concat!("Alignment of ", stringify!(_NVCTRLAttributeValidValues))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributeValidValues>())).permissions as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributeValidValues),
            "::",
            stringify!(permissions)
        )
    );
}
pub type NVCTRLAttributeValidValuesRec = _NVCTRLAttributeValidValues;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NVCTRLAttributePermissions {
    pub type_: ::std::os::raw::c_int,
    pub permissions: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__NVCTRLAttributePermissions() {
    assert_eq!(
        ::std::mem::size_of::<_NVCTRLAttributePermissions>(),
        8usize,
        concat!("Size of: ", stringify!(_NVCTRLAttributePermissions))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVCTRLAttributePermissions>(),
        4usize,
        concat!("Alignment of ", stringify!(_NVCTRLAttributePermissions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributePermissions>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributePermissions),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVCTRLAttributePermissions>())).permissions as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVCTRLAttributePermissions),
            "::",
            stringify!(permissions)
        )
    );
}
pub type NVCTRLAttributePermissionsRec = _NVCTRLAttributePermissions;
extern "C" {
    pub fn XNVCTRLQueryExtension(
        dpy: *mut Display,
        event_basep: *mut ::std::os::raw::c_int,
        error_basep: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLQueryVersion(
        dpy: *mut Display,
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLIsNvScreen(
        dpy: *mut Display,
        screen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLQueryTargetCount(
        dpy: *mut Display,
        target_type: ::std::os::raw::c_int,
        value: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNVCTRLSetAttribute(
